tap "hashicorp/tap", trusted: true
tap "homebrew/bundle"
tap "natesales/repo", "https://github.com/natesales/repo", trusted: true
tap "warrensbox/tap", trusted: true
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Mozilla CA bundle for Python
brew "certifi"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# MCP server for Atlassian tools (Confluence, Jira)
brew "mcp-atlassian"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Theme for zsh
brew "powerlevel10k"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# MCP server for Terraform
brew "terraform-mcp-server"
# Linter for Terraform files
brew "tflint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Vault
brew "hashicorp/tap/vault"
brew "natesales/repo/q"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch", link: false
# Display management tool
cask "betterdisplay"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Window peeking utility app
cask "dockdoor"
cask "font-meslo-for-powerlevel10k"
# Utility to hide menu bar items
cask "hiddenbar"
# Remote desktop software
cask "nomachine"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Control your tools with a few keystrokes
cask "raycast"
# Language and framework for policy as code
cask "sentinel"
# Screenshot measurement and annotation tool
cask "shottr"
# The tfswitch command lets you switch between terraform versions.
cask "warrensbox/tap/tfswitch"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
