tap "hashicorp/tap"
tap "homebrew/bundle"
tap "natesales/repo", "https://github.com/natesales/repo"
tap "warrensbox/tap"
brew "bash"
brew "bat"
brew "certifi"
brew "fzf"
brew "gh"
brew "gnu-sed"
brew "htop"
brew "hugo"
brew "jq"
brew "keychain"
brew "lazygit"
brew "mcp-atlassian"
brew "mtr"
brew "node"
brew "optipng"
brew "powerlevel10k"
brew "pre-commit"
brew "python@3.12"
brew "ripgrep"
brew "shfmt"
brew "subversion"
brew "terraform-mcp-server"
brew "tflint"
brew "tree"
brew "uv"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/vault"
brew "natesales/repo/q"
brew "warrensbox/tap/tfswitch", link: false
cask "alt-tab"
cask "betterdisplay"
cask "bettermouse"
cask "copilot-cli"
cask "font-meslo-for-powerlevel10k"
cask "hiddenbar"
cask "hyperkey"
cask "keka"
cask "middleclick"
cask "nomachine"
cask "pearcleaner"
cask "raycast"
cask "sentinel"
cask "shottr"
cask "warrensbox/tap/tfswitch"
cask "vivaldi"
